zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXER.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>U7816</name>
      <description>U7816 module information</description>
      <groupName>U7816</groupName>
      <baseAddress>0x40011c00</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>U7816 Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXEN</name>
              <description>TXEN  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXEN</name>
              <description>RXEN  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CKOEN</name>
              <description>CKOEN  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>HPUAT</name>
              <description>HPUAT  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>HPUEN</name>
              <description>HPUEN  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>FFR</name>
          <description>U7816 Frame Format Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>SFREN</name>
              <description>SFREN  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ERSW</name>
              <description>ERSW  field description</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ERSGD</name>
              <description>ERSGD  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGTEN</name>
              <description>BGTEN  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>REP_T</name>
              <description>REP_T  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>PAR</name>
              <description>PAR  field description</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RFREN</name>
              <description>RFREN  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TREPEN</name>
              <description>TREPEN  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RREPEN</name>
              <description>RREPEN  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DICONV</name>
              <description>DICONV  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>EGTR</name>
          <description>U7816 Extra Guard Time Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXEGT</name>
              <description>TXEGT  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>U7816 Prescaler Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV  field description</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BGR</name>
          <description>U7816 Baud rate Generator Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>PDIV</name>
              <description>PDIV  field description</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBUF</name>
          <description>U7816 Receive Buffer</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXBUF</name>
              <description>RXBUF  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>TXBUF</name>
          <description>U7816 Transmit Buffer</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXBUF</name>
              <description>TXBUF  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>U7816 Interrupt Enable Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXIE</name>
              <description>RXIE  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXIE</name>
              <description>TXIE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LSIE</name>
              <description>LSIE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>U7816 Interrupt Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>WAIT_RPT</name>
              <description>WAIT_RPT  field description</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXBUSY</name>
              <description>TXBUSY  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXBUSY</name>
              <description>RXBUSY  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TPARERR</name>
              <description>TPARERR  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RPARERR</name>
              <description>RPARERR  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>FRERR</name>
              <description>FRERR  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>OVERR</name>
              <description>OVERR  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RXIF</name>
              <description>RXIF  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TXIF</name>
              <description>TXIF  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ERRIF</name>
              <description>ERRIF  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
