zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXER.SVD
        <register>
          <name>BCDMIN</name>
          <description>RTC BCD Minute register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCDMIN</name>
              <description>BCDMIN  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BCDHOUR</name>
          <description>RTC BCD Hour register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCDHOUR</name>
              <description>BCDHOUR  field description</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BCDDATE</name>
          <description>RTC BCD Date register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCDDATE</name>
              <description>BCDDATE  field description</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BCDWEEK</name>
          <description>RTC BCD Week register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCDWEEK</name>
              <description>BCDWEEK  field description</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BCDMONTH</name>
          <description>RTC BCD Month register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCDMONTH</name>
              <description>BCDMONTH  field description</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>BCDYEAR</name>
          <description>RTC BCD Year register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BCDYEAR</name>
              <description>BCDYEAR  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM</name>
          <description>RTC Alarm Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALMEN</name>
              <description>ALMEN  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALARMHOUR</name>
              <description>ALARMHOUR  field description</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ALARMMIN</name>
              <description>ALARMMIN  field description</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ALARMSEC</name>
              <description>ALARMSEC  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>TMSEL</name>
          <description>RTC Time Mark Select</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSEL</name>
              <description>FSEL  field description</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADJUST</name>
          <description>RTC time Adjust Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADJUST</name>
              <description>ADJUST  field description</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ADSIGN</name>
          <description>RTC time Adjust Sign Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADSIGN</name>
              <description>ADSIGN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STPEN</name>
          <description>RTC Time Stamp Enable Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DF</name>
              <description>DF  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STAMP1EN</name>
              <description>STAMP1EN  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STAMP0EN</name>
              <description>STAMP0EN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTAMP0R</name>
          <description>RTC Clock Stamp 0 Rising</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRSTP0R</name>
              <description>HRSTP0R  field description</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MINSTP0R</name>
              <description>MINSTP0R  field description</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SECSTP0R</name>
              <description>SECSTP0R  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CALSTAMP0R</name>
          <description>RTC Calendar Stamp 0 Rising</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YRSTP0R</name>
              <description>YRSTP0R  field description</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MONSTP0R</name>
              <description>MONSTP0R  field description</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WKSTP0R</name>
              <description>WKSTP0R  field description</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DAYSTP0R</name>
              <description>DAYSTP0R  field description</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTAMP0F</name>
          <description>RTC Clock Stamp 0 Falling</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRSTP0F</name>
              <description>HRSTP0F  field description</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MINSTP0F</name>
              <description>MINSTP0F  field description</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SECSTP0F</name>
              <description>SECSTP0F  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CALSTAMP0F</name>
          <description>RTC Calendar Stamp 0 Falling</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YRSTP0F</name>
              <description>YRSTP0F  field description</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MONSTP0F</name>
              <description>MONSTP0F  field description</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WKSTP0F</name>
              <description>WKSTP0F  field description</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DAYSTP0F</name>
              <description>DAYSTP0F  field description</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTAMP1R</name>
          <description>RTC Clock Stamp 1 Rising</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRSTP1R</name>
              <description>HRSTP1R  field description</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MINSTP1R</name>
              <description>MINSTP1R  field description</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SECSTP1R</name>
              <description>SECSTP1R  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CALSTAMP1R</name>
          <description>RTC Calendar Stamp 1 Rising</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YRSTP1R</name>
              <description>YRSTP1R  field description</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MONSTP1R</name>
              <description>MONSTP1R  field description</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WKSTP1R</name>
              <description>WKSTP1R  field description</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DAYSTP1R</name>
              <description>DAYSTP1R  field description</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTAMP1F</name>
          <description>RTC Calendar Stamp 1 Falling</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRSTP1F</name>
              <description>HRSTP1F  field description</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MINSTP1F</name>
              <description>MINSTP1F  field description</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SECSTP1F</name>
              <description>SECSTP1F  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CALSTAMP1F</name>
          <description>RTC Calendar Stamp 1 Falling</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YRSTP1F</name>
              <description>YRSTP1F  field description</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MONSTP1F</name>
              <description>MONSTP1F  field description</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WKSTP1F</name>
              <description>WKSTP1F  field description</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DAYSTP1F</name>
              <description>DAYSTP1F  field description</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ATCCR</name>
          <description>RTC Auto Temperature Calibration Control Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACALEN</name>
              <description>ACALEN  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
