zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33A0XXER.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOF</name>
      <description>GPIOF module information</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40000d40</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x2c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INEN</name>
          <description>GPIOF Input Enable Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxINEN</name>
              <description>PxINEN  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUEN</name>
          <description>GPIOF Pull-Up Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxPUEN</name>
              <description>PxPUEN  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ODEN</name>
          <description>GPIOF Opeb-Drain Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxODEN</name>
              <description>PxODEN  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>GPIOF Function Control Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Px15FCR</name>
              <description>Px15FCR  field description</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px14FCR</name>
              <description>Px14FCR  field description</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px13FCR</name>
              <description>Px13FCR  field description</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px12FCR</name>
              <description>Px12FCR  field description</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px11FCR</name>
              <description>Px11FCR  field description</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px10FCR</name>
              <description>Px10FCR  field description</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px9FCR</name>
              <description>Px9FCR  field description</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px8FCR</name>
              <description>Px8FCR  field description</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px7FCR</name>
              <description>Px7FCR  field description</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px6FCR</name>
              <description>Px6FCR  field description</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px5FCR</name>
              <description>Px5FCR  field description</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px4FCR</name>
              <description>Px4FCR  field description</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px3FCR</name>
              <description>Px3FCR  field description</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px2FCR</name>
              <description>Px2FCR  field description</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px1FCR</name>
              <description>Px1FCR  field description</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Px0FCR</name>
              <description>Px0FCR  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DO</name>
          <description>GPIOF Data Output Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxDO</name>
              <description>PxDO  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DSET</name>
          <description>GPIOF Data Set Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxSET</name>
              <description>PxSET  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DRST</name>
          <description>GPIOF Data Reset Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxRESET</name>
              <description>PxRESET  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN</name>
          <description>GPIOF Data Input Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxDIN</name>
              <description>PxDIN  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DFS</name>
          <description>GPIOF Digital Function Select</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxDFS</name>
              <description>PxDFS  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ANEN</name>
          <description>GPIOF Analog channel Enable Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PxANEN</name>
              <description>PxANEN  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
